perf/results/baseline.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf/scenarios/baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 3 looping VUs for 1m20s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 1/3 VUs, 31 complete and 0 interrupted iterations
default   [   1% ] 1/3 VUs  0m01.0s/1m20.0s

running (0m02.0s), 1/3 VUs, 99 complete and 0 interrupted iterations
default   [   2% ] 1/3 VUs  0m02.0s/1m20.0s

running (0m03.0s), 1/3 VUs, 177 complete and 0 interrupted iterations
default   [   4% ] 1/3 VUs  0m03.0s/1m20.0s

running (0m04.0s), 1/3 VUs, 258 complete and 0 interrupted iterations
default   [   5% ] 1/3 VUs  0m04.0s/1m20.0s

running (0m05.0s), 1/3 VUs, 345 complete and 0 interrupted iterations
default   [   6% ] 1/3 VUs  0m05.0s/1m20.0s

running (0m06.0s), 1/3 VUs, 439 complete and 0 interrupted iterations
default   [   7% ] 1/3 VUs  0m06.0s/1m20.0s

running (0m07.0s), 1/3 VUs, 535 complete and 0 interrupted iterations
default   [   9% ] 1/3 VUs  0m07.0s/1m20.0s

running (0m08.0s), 1/3 VUs, 636 complete and 0 interrupted iterations
default   [  10% ] 1/3 VUs  0m08.0s/1m20.0s

running (0m09.0s), 1/3 VUs, 743 complete and 0 interrupted iterations
default   [  11% ] 1/3 VUs  0m09.0s/1m20.0s

running (0m10.0s), 1/3 VUs, 852 complete and 0 interrupted iterations
default   [  12% ] 1/3 VUs  0m10.0s/1m20.0s

running (0m11.0s), 2/3 VUs, 1058 complete and 0 interrupted iterations
default   [  14% ] 2/3 VUs  0m11.0s/1m20.0s

running (0m12.0s), 2/3 VUs, 1279 complete and 0 interrupted iterations
default   [  15% ] 2/3 VUs  0m12.0s/1m20.0s

running (0m13.0s), 2/3 VUs, 1509 complete and 0 interrupted iterations
default   [  16% ] 2/3 VUs  0m13.0s/1m20.0s

running (0m14.0s), 2/3 VUs, 1746 complete and 0 interrupted iterations
default   [  17% ] 2/3 VUs  0m14.0s/1m20.0s

running (0m15.0s), 2/3 VUs, 1990 complete and 0 interrupted iterations
default   [  19% ] 2/3 VUs  0m15.0s/1m20.0s

running (0m16.0s), 2/3 VUs, 2236 complete and 0 interrupted iterations
default   [  20% ] 2/3 VUs  0m16.0s/1m20.0s

running (0m17.0s), 2/3 VUs, 2484 complete and 0 interrupted iterations
default   [  21% ] 2/3 VUs  0m17.0s/1m20.0s

running (0m18.0s), 2/3 VUs, 2736 complete and 0 interrupted iterations
default   [  22% ] 2/3 VUs  0m18.0s/1m20.0s

running (0m19.0s), 2/3 VUs, 2986 complete and 0 interrupted iterations
default   [  24% ] 2/3 VUs  0m19.0s/1m20.0s

running (0m20.0s), 2/3 VUs, 3266 complete and 0 interrupted iterations
default   [  25% ] 2/3 VUs  0m20.0s/1m20.0s

running (0m21.0s), 2/3 VUs, 3538 complete and 0 interrupted iterations
default   [  26% ] 2/3 VUs  0m21.0s/1m20.0s

running (0m22.0s), 2/3 VUs, 3848 complete and 0 interrupted iterations
default   [  27% ] 2/3 VUs  0m22.0s/1m20.0s

running (0m23.0s), 2/3 VUs, 4139 complete and 0 interrupted iterations
default   [  29% ] 2/3 VUs  0m23.0s/1m20.0s

running (0m24.0s), 2/3 VUs, 4428 complete and 0 interrupted iterations
default   [  30% ] 2/3 VUs  0m24.0s/1m20.0s

running (0m25.0s), 2/3 VUs, 4708 complete and 0 interrupted iterations
default   [  31% ] 2/3 VUs  0m25.0s/1m20.0s

running (0m26.0s), 2/3 VUs, 4998 complete and 0 interrupted iterations
default   [  32% ] 2/3 VUs  0m26.0s/1m20.0s

running (0m27.0s), 2/3 VUs, 5304 complete and 0 interrupted iterations
default   [  34% ] 2/3 VUs  0m27.0s/1m20.0s

running (0m28.0s), 2/3 VUs, 5591 complete and 0 interrupted iterations
default   [  35% ] 2/3 VUs  0m28.0s/1m20.0s

running (0m29.0s), 2/3 VUs, 5889 complete and 0 interrupted iterations
default   [  36% ] 2/3 VUs  0m29.0s/1m20.0s

running (0m30.0s), 2/3 VUs, 6204 complete and 0 interrupted iterations
default   [  37% ] 2/3 VUs  0m30.0s/1m20.0s

running (0m31.0s), 2/3 VUs, 6524 complete and 0 interrupted iterations
default   [  39% ] 2/3 VUs  0m31.0s/1m20.0s

running (0m32.0s), 2/3 VUs, 6841 complete and 0 interrupted iterations
default   [  40% ] 2/3 VUs  0m32.0s/1m20.0s

running (0m33.0s), 2/3 VUs, 7176 complete and 0 interrupted iterations
default   [  41% ] 2/3 VUs  0m33.0s/1m20.0s

running (0m34.0s), 2/3 VUs, 7512 complete and 0 interrupted iterations
default   [  42% ] 2/3 VUs  0m34.0s/1m20.0s

running (0m35.0s), 2/3 VUs, 7841 complete and 0 interrupted iterations
default   [  44% ] 2/3 VUs  0m35.0s/1m20.0s

running (0m36.0s), 2/3 VUs, 8175 complete and 0 interrupted iterations
default   [  45% ] 2/3 VUs  0m36.0s/1m20.0s

running (0m37.0s), 2/3 VUs, 8513 complete and 0 interrupted iterations
default   [  46% ] 2/3 VUs  0m37.0s/1m20.0s

running (0m38.0s), 2/3 VUs, 8857 complete and 0 interrupted iterations
default   [  47% ] 2/3 VUs  0m38.0s/1m20.0s

running (0m39.0s), 2/3 VUs, 9188 complete and 0 interrupted iterations
default   [  49% ] 2/3 VUs  0m39.0s/1m20.0s

running (0m40.0s), 2/3 VUs, 9546 complete and 0 interrupted iterations
default   [  50% ] 2/3 VUs  0m40.0s/1m20.0s

running (0m41.0s), 2/3 VUs, 9874 complete and 0 interrupted iterations
default   [  51% ] 2/3 VUs  0m41.0s/1m20.0s

running (0m42.0s), 2/3 VUs, 10226 complete and 0 interrupted iterations
default   [  52% ] 2/3 VUs  0m42.0s/1m20.0s

running (0m43.0s), 2/3 VUs, 10573 complete and 0 interrupted iterations
default   [  54% ] 2/3 VUs  0m43.0s/1m20.0s

running (0m44.0s), 2/3 VUs, 10911 complete and 0 interrupted iterations
default   [  55% ] 2/3 VUs  0m44.0s/1m20.0s

running (0m45.0s), 2/3 VUs, 11258 complete and 0 interrupted iterations
default   [  56% ] 2/3 VUs  0m45.0s/1m20.0s

running (0m46.0s), 2/3 VUs, 11610 complete and 0 interrupted iterations
default   [  57% ] 2/3 VUs  0m46.0s/1m20.0s

running (0m47.0s), 2/3 VUs, 11938 complete and 0 interrupted iterations
default   [  59% ] 2/3 VUs  0m47.0s/1m20.0s

running (0m48.0s), 2/3 VUs, 12282 complete and 0 interrupted iterations
default   [  60% ] 2/3 VUs  0m48.0s/1m20.0s

running (0m49.0s), 2/3 VUs, 12614 complete and 0 interrupted iterations
default   [  61% ] 2/3 VUs  0m49.0s/1m20.0s

running (0m50.0s), 2/3 VUs, 12958 complete and 0 interrupted iterations
default   [  62% ] 2/3 VUs  0m50.0s/1m20.0s

running (0m51.0s), 2/3 VUs, 13304 complete and 0 interrupted iterations
default   [  64% ] 2/3 VUs  0m51.0s/1m20.0s

running (0m52.0s), 2/3 VUs, 13661 complete and 0 interrupted iterations
default   [  65% ] 2/3 VUs  0m52.0s/1m20.0s

running (0m53.0s), 2/3 VUs, 14009 complete and 0 interrupted iterations
default   [  66% ] 2/3 VUs  0m53.0s/1m20.0s

running (0m54.0s), 2/3 VUs, 14358 complete and 0 interrupted iterations
default   [  67% ] 2/3 VUs  0m54.0s/1m20.0s

running (0m55.0s), 2/3 VUs, 14701 complete and 0 interrupted iterations
default   [  69% ] 2/3 VUs  0m55.0s/1m20.0s

running (0m56.0s), 2/3 VUs, 15046 complete and 0 interrupted iterations
default   [  70% ] 2/3 VUs  0m56.0s/1m20.0s

running (0m57.0s), 2/3 VUs, 15381 complete and 0 interrupted iterations
default   [  71% ] 2/3 VUs  0m57.0s/1m20.0s

running (0m58.0s), 2/3 VUs, 15737 complete and 0 interrupted iterations
default   [  72% ] 2/3 VUs  0m58.0s/1m20.0s

running (0m59.0s), 2/3 VUs, 16093 complete and 0 interrupted iterations
default   [  74% ] 2/3 VUs  0m59.0s/1m20.0s

running (1m00.0s), 2/3 VUs, 16440 complete and 0 interrupted iterations
default   [  75% ] 2/3 VUs  1m00.0s/1m20.0s

running (1m01.0s), 2/3 VUs, 16781 complete and 0 interrupted iterations
default   [  76% ] 2/3 VUs  1m01.0s/1m20.0s

running (1m02.0s), 2/3 VUs, 17115 complete and 0 interrupted iterations
default   [  77% ] 2/3 VUs  1m02.0s/1m20.0s

running (1m03.0s), 2/3 VUs, 17432 complete and 0 interrupted iterations
default   [  79% ] 2/3 VUs  1m03.0s/1m20.0s

running (1m04.0s), 2/3 VUs, 17779 complete and 0 interrupted iterations
default   [  80% ] 2/3 VUs  1m04.0s/1m20.0s

running (1m05.0s), 2/3 VUs, 18119 complete and 0 interrupted iterations
default   [  81% ] 2/3 VUs  1m05.0s/1m20.0s

running (1m06.0s), 2/3 VUs, 18476 complete and 0 interrupted iterations
default   [  82% ] 2/3 VUs  1m06.0s/1m20.0s

running (1m07.0s), 2/3 VUs, 18824 complete and 0 interrupted iterations
default   [  84% ] 2/3 VUs  1m07.0s/1m20.0s

running (1m08.0s), 2/3 VUs, 19165 complete and 0 interrupted iterations
default   [  85% ] 2/3 VUs  1m08.0s/1m20.0s

running (1m09.0s), 2/3 VUs, 19518 complete and 0 interrupted iterations
default   [  86% ] 2/3 VUs  1m09.0s/1m20.0s

running (1m10.0s), 2/3 VUs, 19872 complete and 0 interrupted iterations
default   [  87% ] 2/3 VUs  1m10.0s/1m20.0s

running (1m11.0s), 3/3 VUs, 20367 complete and 0 interrupted iterations
default   [  89% ] 3/3 VUs  1m11.0s/1m20.0s

running (1m12.0s), 3/3 VUs, 20949 complete and 0 interrupted iterations
default   [  90% ] 3/3 VUs  1m12.0s/1m20.0s

running (1m13.0s), 3/3 VUs, 21509 complete and 0 interrupted iterations
default   [  91% ] 3/3 VUs  1m13.0s/1m20.0s

running (1m14.0s), 2/3 VUs, 21910 complete and 0 interrupted iterations
default   [  92% ] 2/3 VUs  1m14.0s/1m20.0s

running (1m15.0s), 2/3 VUs, 22264 complete and 0 interrupted iterations
default   [  94% ] 2/3 VUs  1m15.0s/1m20.0s

running (1m16.0s), 2/3 VUs, 22616 complete and 0 interrupted iterations
default   [  95% ] 2/3 VUs  1m16.0s/1m20.0s

running (1m17.0s), 1/3 VUs, 22906 complete and 0 interrupted iterations
default   [  96% ] 1/3 VUs  1m17.0s/1m20.0s

running (1m18.0s), 1/3 VUs, 23092 complete and 0 interrupted iterations
default   [  97% ] 1/3 VUs  1m18.0s/1m20.0s

running (1m19.0s), 1/3 VUs, 23273 complete and 0 interrupted iterations
default   [  99% ] 1/3 VUs  1m19.0s/1m20.0s

running (1m20.0s), 1/3 VUs, 23458 complete and 0 interrupted iterations
default   [ 100% ] 1/3 VUs  1m20.0s/1m20.0s


  █ THRESHOLDS 

    http_req_duration{kind:order}
    ✓ 'p(95)<1500' p(95)=9.33ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 23461   293.257801/s
    checks_succeeded...: 100.00% 23461 out of 23461
    checks_failed......: 0.00%   0 out of 23461

    ✓ status 201

    HTTP
    http_req_duration..............: avg=6.34ms min=2.98ms med=5.9ms  max=509.59ms p(90)=8.19ms p(95)=9.33ms
      { expected_response:true }...: avg=6.34ms min=2.98ms med=5.9ms  max=509.59ms p(90)=8.19ms p(95)=9.33ms
      { kind:order }...............: avg=6.34ms min=2.98ms med=5.9ms  max=509.59ms p(90)=8.19ms p(95)=9.33ms
    http_req_failed................: 0.00%  0 out of 23461
    http_reqs......................: 23461  293.257801/s

    EXECUTION
    iteration_duration.............: avg=6.39ms min=3.02ms med=5.94ms max=513.63ms p(90)=8.25ms p(95)=9.4ms 
    iterations.....................: 23461  293.257801/s
    vus............................: 1      min=1          max=3
    vus_max........................: 3      min=3          max=3

    NETWORK
    data_received..................: 6.9 MB 87 kB/s
    data_sent......................: 4.6 MB 57 kB/s



running (1m20.0s), 0/3 VUs, 23461 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/3 VUs  1m20s